app/controllers/public_controller.rb

def popular
  accesses = Access.find(:all, :limit=>1000, :order=> 'created_at DESC')
  counts = Hash.new()
  accesses.each do |access|
---
SELECT * FROM "accesses" ORDER BY created_at DESC LIMIT 1000

def create_url
  redirect_to :action=>:index and return unless params['url']
  url = params['url']

  @item = Item.new()
  @item.url = url
  if params['title'] && params['title'] != ''
    @item.title = params['title']
  else
    @item.title = get_title(url)
  end
  redirect_to :action=>:index and return unless @item.save
---
INSERT INTO "items" ("created_at", "code", "title", "updated_at", "url") VALUES('2010-01-10 06:21:48', NULL, '', '2010-01-10 06:21:48', '')

def redirect_url
  redirect_to :action=>:index and return unless params['code']
  code = params['code']

  @item = Item.find(:first, :conditions => ['code = ?',code])
  redirect_to :action=>:index and return unless @item

  @access = Access.new()
  @access.item_id = @item.id
  @access.ip = request.remote_ip
  @access.referrer = request.referrer
  redirect_to :action=>:index and return unless @access.save()
---
SELECT * FROM "items" WHERE (code = 'N') LIMIT 1
INSERT INTO "accesses" ("referrer", "created_at", "updated_at", "time", "ip") VALUES('/', '2010-01-10 07:39:00', '2010-01-10 07:39:00', NULL, '127.0.0.1')